George262004/STM32l432xx_Drivers/Src/001LED_TOGGLE.c
/*
 * 001LED_TOGGLE.c
 *
 *  Created on: Jan 16, 2026
 *      Author: geo26
 */

#include "stm32l432xx.h"


void delay(void){
	for(uint32_t i = 0; i < 50000; i++);
}

int main(void){

	GPIO_HANDLE_t GpioBtn;
	GpioBtn.pGPIOx = GPIOB ;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_5;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;


	GPIO_HANDLE_t GpioLed;
	GpioLed.pGPIOx = GPIOB ;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_out;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_3;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	GPIO_PeriClockControl(GPIOB, ENABLE);
	GPIO_Init(&GpioBtn);

	GPIO_Init(&GpioLed);

	while(1){
		if(GPIO_ReadFromInputPin(GPIOB, GPIO_PIN_NO_5) == GPIO_PIN_SET){

			GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_3, GPIO_PIN_SET);

		}else{

			GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_3, GPIO_PIN_RESET);

		}

		delay();
	}


	return 0;

}
